{
    "languages": [
        {
            "img": "/assets/html.jpg",
            "title": "HTML",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/css.jpg",
            "title": "CSS",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/javascript.jpg",
            "title": "JavaScript",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/php.jpg",
            "title": "PHP",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/mysql.jpg",
            "title": "MySQL",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/bootstrap.jpg",
            "title": "Bootstrap",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/vuejs.jpg",
            "title": "Vue.js",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/laravel.jpg",
            "title": "Laravel",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/tailwindcss.jpg",
            "title": "TailwindCSS",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        }
    ],
    "frameworks": [
        {
            "img": "/assets/pixijs.jpg",
            "title": "PixiJS",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/excaliburjs.jpg",
            "title": "ExcaliburJS",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/renpy.jpg",
            "title": "Ren'Py",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/expressjs.jpg",
            "title": "Express.js",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        },
        {
            "img": "/assets/reactjs.jpg",
            "title": "React.js",
            "summary": null,
            "description": null,
            "github_link": null,
            "favoritized": false
        }
    ], 
    "projects": [
        {
            "img": "/assets/onepager.jpg",
            "title": "Onepager",
            "summary": {
                "nl": "Project uit 2021 - 2022",
                "en": "Project from 2021 - 2022"
            },
            "description": {
                "nl": "Project uit 2021 - 2022",
                "en": "Project from 2021 - 2022"
            },
            "github_link": "https://github.com/CurleyDS/onepager",
            "favoritized": false
        },
        {
            "img": "/assets/pepperoniparty.jpg",
            "title": "Pepperoni Party",
            "summary": {
                "nl": "Project uit 2021 - 2022",
                "en": "Project from 2021 - 2022"
            },
            "description": {
                "nl": "Project uit 2021 - 2022",
                "en": "Project from 2021 - 2022"
            },
            "github_link": "https://github.com/CurleyDS/CLE4",
            "favoritized": false
        },
        {
            "img": "/assets/spacemeteors.jpg",
            "title": "Space Meteors",
            "summary": {
                "nl": "Project uit 2022 - 2023",
                "en": "Project from 2022 - 2023"
            },
            "description": {
                "nl": "Project uit 2021 - 2022",
                "en": "Project from 2022 - 2023"
            },
            "github_link": "https://github.com/CurleyDS/PRG04-2022-2023",
            "favoritized": false
        },
        {
            "img": "/assets/factorybreakout.jpg",
            "title": "Factory Breakout",
            "summary": {
                "nl": "Project uit 2022 - 2023",
                "en": "Project from 2022 - 2023"
            },
            "description": {
                "nl": "Factory Breakout is een spel waar je in een oude fabriek wakker wordt en niet meer weet hoe je er bent belandt. Dit spel is gemaakt in Excalibur.js, een framework voor het maken van 2D games. Het doel van het spel is om te ontsnappen zonder ontdekt te worden door de bewakers. \n\nJe kunt je verstoppen voor bewakers terwijl je puzzels oplost en erachter komt hoe je in de fabriek bent belandt. \n\nMijn taak bestond uit het werken aan de logica en mechanieken van het spel. Logica en mechanieken zoals lopen, springen, kruipen en verstoppen. Ook was ik verantwoordelijk voor het fixen van de bugs. \n\nIk heb de documentatie van Excalibur.js bestudeert en deze beoefent om het beter te begrijpen. Ik heb hiermee de logica toegepast zoals het navigeren naar andere levels, het winnen en verliezen van deze levels en de bugs opgelost die tijdens het project zijn opgekomen. Ook heb ik de mechanieken (lopen, springen, kruipen en verstoppen) voor het spel toegepast. \n\n![Factory Breakout](/assets/fb-startscreen.jpg) ![Factory Breakout](/assets/fb-levelzero.jpg) ![Factory Breakout](/assets/fb-levelone.jpg) \n\nNa het project heeft ons team het spel gepresenteerd. Er waren nog wat bugs die achteraf werden ontdekt, maar ondanks dit kregen we een positieve reactie van onze opdrachtgevers over het spel dat we hebben gecreëerd. \n\nUit dit project heb ik geleerd om te gaan met Excalibur.js en hierdoor heb ik een nog beter begrip gekregen voor mijn kennis over basis HTML, CSS én JavaScript. \n\n",
                "en": "Factory Breakout is a game where you wake up in an old factory and can't remember how you got there. This game was created in Excalibur.js, a framework for creating 2D games. The aim of the game is to escape without being discovered by the guards. \n\nYou can hide from guards while solving puzzles and figuring out how you ended up in the factory. \n\nMy job consisted of working on the logic and mechanics of the game. Logic and mechanics such as walking, jumping, crawling and hiding. I was also responsible for fixing the bugs. \n\nI have been studying the Excalibur.js documentation and practiced it to understand it better. I applied the logic such as navigating to other levels, winning and losing these levels and fixed the bugs that arose during the project. I also applied the mechanics (walking, jumping, crawling and hiding) to the game. \n\n![Factory Breakout](/assets/fb-startscreen.jpg) ![Factory Breakout](/assets/fb-levelzero.jpg) ![Factory Breakout](/assets/fb-levelone.jpg) \n\nAfter the project, our team presented the game. There were some bugs that were discovered afterwards, but despite that we received a positive response from our clients about the game we had created. \n\nFrom this project I learned how to use Excalibur.js and ultimately I gained an even better understanding of my knowledge of basic HTML, CSS and JavaScript. \n\n"
            },
            "github_link": "https://github.com/CurleyDS/CLE4-2023",
            "favoritized": true
        },
        {
            "img": "/assets/youngchoices.jpg",
            "title": "Young Choices",
            "summary": {
                "nl": "Project uit 2023 - 2024",
                "en": "Project from 2023 - 2024"
            },
            "description": {
                "nl": "Young Choices is een website die zich richt op de belangrijke onderwerpen waarmee jongeren worden geconfronteerd tijdens hun ontwikkelproces. Deze website is gemaakt in Laravel, open-source PHP framework. Het doel is om jongeren te voorzien van kennis en nodige tools, zodat ze weloverwogen beslissingen kunnen nemen die hun toekomst positief beïnvloeden. \n\nIn elke onderdeel van de website vind je artikelen met informatie voor jongeren die op zoek zijn naar betrouwbare begeleiding. De bedoeling is dat deze artikelen door deskundige psychologen worden gemaakt. Deze artikelen zijn hierdoor niet alleen informatief zijn, maar ook praktisch toepasbaar. \n\nMijn taak in het project was om een lijst aan artikelen uit de database te tonen op de website. Elk artikel heeft een detailpagina. Je kunt een gefilterde lijst tonen, gebaseerd op gefavoriseerde artikelen. Deze artikelen kun je ook delen doormiddel van een deel-knop. Ook moest ik een zoekfilter maken waardoor je sneller en makkelijker het artikel kon vinden dat je zoekt. \n\nIk had al ervaring met Laravel en PHP dankzij mijn opleiding Software Development op Da Vinci College. Hierdoor had ik een beter begrip in hoe het framework werkte. Ik heb een pagina gemaakt die de lijst met artikelen toont. Je kunt artikelen favoriseren en ze bekijken op een andere pagina. Ook heb ik een ervoor gezorgd dat je een artikel kunt delen door de URL te kopiëren. De zoekfilter kan filteren op de titel, de beschrijving van een artikel, de onderwerpen en de leeftijd voor welke jongeren het artikel was bedoeld. \n\n![Young Choices](/assets/yc-homepage.jpg) ![Young Choices](/assets/yc-articlepage.jpg) \n\nNa het project heeft ons team de website gepresenteerd. We kregen een zeer positieve reactie van onze opdrachtgevers over de website die we hadden gemaakt. \n\nUit dit project heb ik een verbeterd begrip gekregen voor mijn kennis over Laravel, basis PHP en zelfs een beetje SQL. \n\n",
                "en": "Young Choices is a website that focuses on the important topics that young people face during their development process. This website was created in Laravel, an open-source PHP framework. The goal is to provide young people with knowledge and necessary tools so they can make informed decisions that positively influence their future. \n\nIn each section of the website you will find articles with information for young people who are looking for reliable guidance. The intention is that these articles are created by expert psychologists. These articles are therefore not only informative, but also practically applicable. \n\nMy task in the project was to display a list of articles from the database on the website. Each article has a detail page. You can show a filtered list based on favorited articles. You can also share these articles using a share button. I also had to create a search filter so that you could find an article you're looking for in a faster and easier way. \n\nI already had experience with Laravel and PHP thanks to my course Software Development at Da Vinci College. This gave me a better understanding of how the framework worked. I have created a page that shows the list of articles. You can favorite the articles and view the favorited articles on another page. I have also made sure that you can share an article by copying the URL. The search filter can filter on the title, the description of an article, the topics and the age for which age group of people the article was intended for. \n\n![Young Choices](/assets/yc-homepage.jpg) ![Young Choices](/assets/yc-articlepage.jpg) \n\nAfter the project, our team presented the website. We received a very positive response from our clients about the website we created. \n\nFrom this project I gained an improved understanding of my knowledge of Laravel, basic PHP and even some SQL. \n\n"
            },
            "github_link": "https://github.com/MarkDeKraker/TLE1-Team11",
            "favoritized": true
        },
        {
            "img": "/assets/weetjegezond.jpg",
            "title": "Weetjegezond",
            "summary": {
                "nl": "Project uit 2023 - 2024 (Momenteel is dit project Private)",
                "en": "Project from 2023 - 2024 (Currently this project is set to Private)"
            },
            "description": {
                "nl": "Project uit 2023 - 2024 (Momenteel is dit project Private) \n\n![Weetjegezond](/assets/wg-homepage.jpg) ![Weetjegezond](/assets/wg-profilepage.jpg)\n\n",
                "en": "Project from 2023 - 2024 (Currently this project is set to Private) \n\n![Weetjegezond](/assets/wg-homepage.jpg) ![Weetjegezond](/assets/wg-profilepage.jpg)\n\n"
            },
            "github_link": "https://github.com/MikkaDG/weetjegezond",
            "favoritized": true
        }
    ]
}